
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = "Изменилась количество";

	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

// Пересчет суммы.
// 
// Параметры:
//  СтрокаТовары - ДанныеФормыЭлементКоллекции - Строка товары
//  СообщениеПользователю - Строка - Сообщение пользователю
&НаКлиенте
Процедура ПересчетСуммы(СтрокаТовары, СообщениеПользователю) Экспорт

	СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;
	Сообщить(СообщениеПользователю);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстСообщения = "Изменилась цена";
	
	ПересчетСуммы(ТекущиеДанные, ТекстСообщения);
	
	Пользователь = ОписаниеПользовтеля();
	
	Сообщить(Пользователь.ДатаРождения);
	
КонецПроцедуры

// Описание пользовтеля.
// 
// Возвращаемое значение:
//  Структура - Описание пользовтеля:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатаный - Булево - 
&НаКлиенте
Функция ОписаниеПользовтеля()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатаный", Истина);
	
	Возврат Человек;
	
КонецФункции